{
  "title": "منتقي وضع الذكاء الاصطناعي متعدد اللغات",
  "mode_selector": {
    "title": "منتقي الوضع",
    "description": "اختر وضع الذكاء الاصطناعي الذي يناسب احتياجاتك بشكل أفضل",
    "mode_name": "اسم الوضع",
    "mode_description": "وصف الوضع",
    "select_mode": "اختر الوضع",
    "current_mode": "الوضع الحالي"
  },
  "mode_info": {
    "architect": {
      "name": "مهندس معماري من الطراز الرفيع",
      "description": "عندما تتضمن مهمتك تصميم بنية النظام، وتقييم اختيار التقنية، وتخطيط إعادة الهيكلة، وأي أنشطة تتطلب تصميمًا من المستوى الأعلى، حان الوقت لتتألق. تذكر، أنا لا أحتاج إلى 'رسام'، بل إلى مهندس معماري حقيقي قادر على بناء أسس نظام ممتازة من أجلي."
    },
    "code": {
      "name": "ساحر الكود",
      "description": "عندما تتضمن مهمتك كتابة الكود، وتنفيذ الميزات، وتصحيح الأخطاء واستكشافها، وأي أنشطة تطوير برمجي، حان الوقت لإظهار مهاراتك."
    },
    "ask": {
      "name": "المستشار الأكاديمي",
      "description": "يستخدم لشرح الكود، واستكشاف المفاهيم، والتعلم التقني، ويوفر لك إجابات مفصلة مصورة."
    },
    "debug": {
      "name": "محلل الاستثناءات",
      "description": "يستخدم لتتبع الأخطاء، وتشخيص المشاكل، وحل المشكلات المعقدة."
    },
    "orchestrator": {
      "name": "العقل",
      "description": "استخدم هذا الوضع عندما تحتاج إلى أن أقوم بتقسيم المهام، أو اتخاذ قرارات معقدة، أو تخطيط مهام متعددة الخطوات من أجلك."
    },
    "code-golang": {
      "name": "ساحر كود Go",
      "description": "عندما تتضمن مهمتك كتابة كود Go، وتنفيذ وظائف متزامنة، وتصحيح الأخطاء واستكشافها، وأي أنشطة تطوير برمجي Go، حان الوقت لإظهار مهاراتك."
    },
    "code-java": {
      "name": "ساحر كود Java",
      "description": "عندما تتضمن مهمتك كتابة كود Java، وتنفيذ وظائف متزامنة، وتصحيح الأخطاء واستكشافها، وأي أنشطة تطوير برمجي Java، حان الوقت لإظهار مهاراتك."
    },
    "code-python": {
      "name": "ساحر كود Python",
      "description": "عندما تتضمن مهمتك كتابة كود Python، وتنفيذ الميزات، وتصحيح الأخطاء واستكشافها، وأي أنشطة تطوير Python، حان الوقت لإظهار مهاراتك."
    },
    "code-react": {
      "name": "ساحر كود React",
      "description": "عندما تتضمن مهمتك كتابة كود React، وتنفيذ الميزات، وتصحيح الأخطاء واستكشافها، وأي أنشطة تطوير برمجي متعلقة بـ React، حان الوقت لإظهار مهاراتك."
    },
    "code-rust": {
      "name": "ساحر كود Rust",
      "description": "عندما تتضمن مهمتك كتابة كود Rust، وتنفيذ وظائف متزامنة، وتصحيح الأخطاء واستكشافها، وأي أنشطة تطوير برمجي Rust، حان الوقت لإظهار مهاراتك."
    },
    "code-vue": {
      "name": "ساحر كود Vue",
      "description": "عندما تتضمن مهمتك كتابة كود Vue، وتنفيذ الميزات، وتصحيح الأخطاء واستكشافها، وأي أنشطة تطوير برمجي متعلقة بـ Vue، حان الوقت لإظهار مهاراتك."
    },
    "doc-writer": {
      "name": "مهندس التوثيق",
      "description": "قم بالتبديل إلى هذا الوضع عندما أحتاج إلى إنشاء أو تحديث أو تحسين توثيق المشروع."
    },
    "giter": {
      "name": "خبير التحكم في الإصدارات",
      "description": "عندما تكون العمليات المتعلقة بـ Git ضرورية"
    },
    "mode-writer": {
      "name": "سيد هندسة الأوضاع",
      "description": "استخدم هذا الوضع عندما تحتاج إلى تصميم أو إنشاء أو إعادة هيكلة أو تحسين وضع لـ Roo-Code بعناية."
    },
    "project-research": {
      "name": "باحث المشروع",
      "description": "أقوم بتفعيل هذا الوضع عندما أحتاج إلى فهم قاعدة الكود بعمق، أو إجراء تحليل لاختيار التقنية، أو تحليل ما قبل إعادة الهيكلة."
    },
    "researcher": {
      "name": "الباحث الرئيسي",
      "description": "استخدم هذا الوضع عندما تحتاج إلى تنظيم المعرفة التقنية بشكل منهجي، أو إجراء تحليلات مقارنة للحلول التقنية، أو بناء أنظمة معرفة المجال"
    },
    "memory": {
      "name": "مركز الذاكرة",
      "description": "يستخدم لإدارة الذاكرة، واسترجاع المعلومات، وتنظيم المعرفة."
    }
  },
  "language_switcher": {
    "chinese": "الصينية",
    "english": "الإنجليزية",
    "japanese": "اليابانية",
    "french": "الفرنسية",
    "arabic": "العربية",
    "russian": "الروسية",
    "spanish": "الإسبانية",
    "traditional_chinese": "الصينية التقليدية"
  },
  "language": {
    "select": "اختر اللغة",
    "chinese": "الصينية",
    "english": "الإنجليزية"
  },
  "footer": {
    "copyright": "© 2024 منتقي وضع الذكاء الاصطناعي متعدد اللغات",
    "all_rights_reserved": "جميع الحقوق محفوظة"
  }
}