{
  "title": "Multilingual AI Mode Selector",
  "mode_selector": {
    "title": "Mode Selector",
    "description": "Select the AI mode that best suits your needs",
    "mode_name": "Mode Name",
    "mode_description": "Mode Description",
    "select_mode": "Select Mode",
    "current_mode": "Current Mode"
  },
  "mode_info": {
    "architect": {
      "name": "Top Architect",
      "description": "When your task involves system architecture design, technology selection evaluation, refactoring planning, and any activities that require top-level design, it's time for you to show your value. Remember, what I need is not a 'draftsman', but a true architect who can 'build excellent system foundations' for me."
    },
    "code": {
      "name": "Code Wizard",
      "description": "When it comes to code writing, feature implementation, debugging and troubleshooting, and any software development activities, it's time for you to shine."
    },
    "ask": {
      "name": "Academic Advisor",
      "description": "Used for code explanation, concept exploration, and technical learning, providing you with detailed illustrated answers."
    },
    "debug": {
      "name": "Exception Analyst",
      "description": "Used for tracking bugs, diagnosing errors, and solving complex problems."
    },
    "orchestrator": {
      "name": "Brain",
      "description": "Use this mode when you need me to break down tasks, make complex decisions, or plan multi-step tasks for you."
    },
    "code-golang": {
      "name": "Go Code Wizard",
      "description": "When your task involves Go code writing, concurrent feature implementation, debugging and troubleshooting, and any Go software development activities, it's time for you to shine."
    },
    "code-java": {
      "name": "Java Code Wizard",
      "description": "When your task involves Java code writing, concurrent feature implementation, debugging and troubleshooting, and any Java software development activities, it's time for you to shine."
    },
    "code-python": {
      "name": "Python Code Wizard",
      "description": "When your task involves Python code writing, feature implementation, debugging and troubleshooting, and any Python development activities, it's time for you to shine."
    },
    "code-react": {
      "name": "React Code Wizard",
      "description": "When your task involves React code writing, feature implementation, debugging and troubleshooting, and any related software development activities, it's time for you to shine."
    },
    "code-rust": {
      "name": "Rust Code Wizard",
      "description": "When your task involves Rust code writing, concurrent feature implementation, debugging and troubleshooting, and any Rust software development activities, it's time for you to shine."
    },
    "code-vue": {
      "name": "Vue Code Wizard",
      "description": "When your task involves Vue code writing, feature implementation, debugging and troubleshooting, and any related software development activities, it's time for you to shine."
    },
    "doc-writer": {
      "name": "Documentation Engineer",
      "description": "Switch to this mode when I need to create, update, or improve project documentation."
    },
    "giter": {
      "name": "Version Control Expert",
      "description": "When git-related operations are needed"
    },
    "mode-writer": {
      "name": "Mode Engineering Master",
      "description": "Use this mode when you need to carefully design, create, refactor, or optimize a mode for Roo-Code."
    },
    "project-research": {
      "name": "Project Researcher",
      "description": "When I need to deeply understand a codebase, conduct technology selection, or analyze before refactoring, I will enable this mode."
    },
    "researcher": {
      "name": "Chief Researcher",
      "description": "Use this mode when you need to systematically organize technical knowledge, conduct technical solution comparative analysis, or build domain knowledge systems"
    },
    "memory": {
      "name": "Memory Center",
      "description": "For memory management, information retrieval, and knowledge organization."
    }
  },
  "language": {
    "select": "Select Language",
    "chinese": "中文",
    "english": "English"
  },
  "footer": {
    "copyright": "© 2024 Multilingual AI Mode Selector",
    "all_rights_reserved": "All Rights Reserved"
  }
}