{
  "title": "Мультиязычный селектор режимов ИИ",
  "mode_selector": {
    "title": "Селектор режимов",
    "description": "Выберите режим ИИ, который лучше всего соответствует вашим потребностям",
    "mode_name": "Название режима",
    "mode_description": "Описание режима",
    "select_mode": "Выбрать режим",
    "current_mode": "Текущий режим"
  },
  "mode_info": {
    "architect": {
      "name": "Архитектор высшего уровня",
      "description": "Когда ваша задача включает проектирование системной архитектуры, оценку выбора технологий, планирование рефакторинга и любую деятельность, требующую проектирования высокого уровня, пора вам сиять. Помните, мне не нужен 'чертежник', а настоящий архитектор, способный строить отличные системные основы для меня."
    },
    "code": {
      "name": "Волшебник кода",
      "description": "Когда ваша задача включает написание кода, реализацию функций, отладку и устранение неполадок, а также любую деятельность по разработке программного обеспечения, пора вам показать свои навыки."
    },
    "ask": {
      "name": "Академический консультант",
      "description": "Используется для объяснения кода, исследования концепций и технического обучения, предоставляя вам подробные иллюстрированные ответы."
    },
    "debug": {
      "name": "Аналитик исключений",
      "description": "Используется для отслеживания ошибок, диагностики проблем и решения сложных задач."
    },
    "orchestrator": {
      "name": "Мозг",
      "description": "Используйте этот режим, когда вам нужно, чтобы я разбивал задачи, принимал сложные решения или планировал многошаговые задачи для вас."
    },
    "code-golang": {
      "name": "Волшебник кода Go",
      "description": "Когда ваша задача включает написание кода Go, реализацию параллельных функций, отладку и устранение неполадок, а также любую деятельность по разработке программного обеспечения на Go, пора вам показать свои навыки."
    },
    "code-java": {
      "name": "Волшебник кода Java",
      "description": "Когда ваша задача включает написание кода Java, реализацию параллельных функций, отладку и устранение неполадок, а также любую деятельность по разработке программного обеспечения на Java, пора вам показать свои навыки."
    },
    "code-python": {
      "name": "Волшебник кода Python",
      "description": "Когда ваша задача включает написание кода Python, реализацию функций, отладку и устранение неполадок, а также любую деятельность по разработке на Python, пора вам показать свои навыки."
    },
    "code-react": {
      "name": "Волшебник кода React",
      "description": "Когда ваша задача включает написание кода React, реализацию функций, отладку и устранение неполадок, а также любую связанную деятельность по разработке программного обеспечения, пора вам показать свои навыки."
    },
    "code-rust": {
      "name": "Волшебник кода Rust",
      "description": "Когда ваша задача включает написание кода Rust, реализацию параллельных функций, отладку и устранение неполадок, а также любую деятельность по разработке программного обеспечения на Rust, пора вам показать свои навыки."
    },
    "code-vue": {
      "name": "Волшебник кода Vue",
      "description": "Когда ваша задача включает написание кода Vue, реализацию функций, отладку и устранение неполадок, а также любую связанную деятельность по разработке программного обеспечения, пора вам показать свои навыки."
    },
    "doc-writer": {
      "name": "Инженер документации",
      "description": "Переключитесь на этот режим, когда мне нужно создавать, обновлять или улучшать документацию проекта."
    },
    "giter": {
      "name": "Эксперт по контролю версий",
      "description": "Когда необходимы операции, связанные с Git"
    },
    "mode-writer": {
      "name": "Мастер инженерии режимов",
      "description": "Используйте этот режим, когда вам нужно тщательно проектировать, создавать, рефакторить или оптимизировать режим для Roo-Code."
    },
    "project-research": {
      "name": "Исследователь проекта",
      "description": "Я активирую этот режим, когда мне нужно глубоко понять кодовую базу, провести анализ выбора технологий или пред-рефакторинговый анализ."
    },
    "researcher": {
      "name": "Ведущий исследователь",
      "description": "Используйте этот режим, когда вам нужно систематизировать технические знания, проводить сравнительный анализ технических решений или строить системы знаний предметной области"
    },
    "memory": {
      "name": "Центр памяти",
      "description": "Используется для управления памятью, поиска информации и организации знаний."
    }
  },
  "language_switcher": {
    "chinese": "Китайский",
    "english": "Английский",
    "japanese": "Японский",
    "french": "Французский",
    "arabic": "Арабский",
    "russian": "Русский",
    "spanish": "Испанский",
    "traditional_chinese": "Традиционный китайский"
  },
  "language": {
    "select": "Выбрать язык",
    "chinese": "Китайский",
    "english": "Английский"
  },
  "footer": {
    "copyright": "© 2024 Мультиязычный селектор режимов ИИ",
    "all_rights_reserved": "Все права защищены"
  }
}